---
kind: property
id: P:Autodesk.Revit.DB.SpecTypeId.ElectricalTemperature
source: html/69233618-0be2-7978-d016-95909af0f849.htm
---
# Autodesk.Revit.DB.SpecTypeId.ElectricalTemperature Property

Temperature, in discipline Electrical.

## Syntax (C#)
```csharp
public static ForgeTypeId ElectricalTemperature { get; }
```